---
kind: type
id: T:Autodesk.Revit.DB.GraphicsStyle
source: html/da26fe81-ee66-1036-1f5b-dffe612182d9.htm
---
# Autodesk.Revit.DB.GraphicsStyle

The graphics style instance in Autodesk Revit document.

## Syntax (C#)
```csharp
public class GraphicsStyle : Element
```